@echo off
color 3f
echo ---------------------------------------------------------
::JIAO BEN QIAN LI SHAN CHU GONG JU 
::注释：kun哥 享有该源码版权，盗必究！(XIAO JI NI HAO HAO XUE XUE)
::----------------------------代码开始-------------------------
 echo kun哥脚本强删工具& echo 使用时请关闭杀软，以免将该程序误识别为病毒  & echo 警告：本工具性能过强，请勿用来删除系统，被删除后文件无法找回！& echo 本品用途 删除流氓文件，锁定文件夹，并可以高速删除文件 & echo 将文件路径粘贴或直接拖动文件，本品可以删除任何文件，包括被锁定的文件和系统文件（不建议用以系统文件) & echo 请确保输入的路径合法有效，否则该程序将会报错  & echo ---------------------------------------------------------
set /p kun= "请粘贴想要删除的文件路径"  

  if not exist  %kun%  msg * "%kun%路径无效，请检查！(已自动退出)" & exit 
::kaishi jian jie 




     
  




:: he xin dai ma ------------------------------------------
del /s %kun%                                                         

 msg * "%kun%已删除完毕，谢谢使用,可以退出了"
  
  rd /s/q %kun%
  echo "如出"现找不到文件"现象，则证明该文件已成功被强力删除"
 ::-----------------------------------------------------------
 
 
 
 
 
 
 
 
 
 
 
 ::shows 2nd
 cls
 echo %kun%文件已被强力删除，感谢您的使用，谢谢！（回车退出）
 pause
 
 ::-------------------------代码结束---------------------------